{"words": [
{"word":"K","class":"","meaning":"the eleventh letter of the English alphabet, is nonvocal consonant. The form and sound of the letter K are from the Latin, which used the letter but little except in the early period of the language. It came into the Latin from the Greek, which received it from a Phoenician source, the ultimate origin probably being Egyptian.  Etymologically K is most nearly related to c, g, h (which see).","search":"k"},
{"word":"Kaama","class":"n.","meaning":"The hartbeest.","search":"kaama"},
{"word":"Kabala","class":"n.","meaning":"See Cabala.","search":"kabala"},
{"word":"Kabassou","class":"n.","meaning":"See Cabassou.","search":"kabassou"},
{"word":"Kabob","class":"n. & v. t.","meaning":"See Cabob, n. &amp; v. t.","search":"kabob"},
{"word":"Kabook","class":"n.","meaning":"A clay ironstone found in Ceylon.","search":"kabook"},
{"word":"Kabyle","class":"n.","meaning":"A Berber, as in Algiers or Tunis. See Berber.","search":"kabyle"},
{"word":"Kadder","class":"n.","meaning":"The jackdaw.","search":"kadder"},
{"word":"Kadi","class":"n.","meaning":"Alt. of Kadiaster","search":"kadi"},
{"word":"Kadiaster","class":"n.","meaning":"A Turkish judge. See Cadi.","search":"kadiaster"},
{"word":"Kafal","class":"n.","meaning":"The Arabian name of two trees of the genus Balsamodendron, which yield a gum resin and a red aromatic wood.","search":"kafal"},
{"word":"Kaffir","class":"n.","meaning":"Alt. of Kafir","search":"kaffir"},
{"word":"Kafir","class":"n.","meaning":"One of a race which, with the Hottentots and Bushmen, inhabit South Africa. They inhabit the country north of Cape Colony, the name being now specifically applied to the tribes living between Cape Colony and Natal; but the Zulus of Natal are true Kaffirs.","search":"kafir"},
{"word":"Kafir","class":"n.","meaning":"One of a race inhabiting Kafiristan in Central Asia.","search":"kafir"},
{"word":"Kaffle","class":"n.","meaning":"See Coffle.","search":"kaffle"},
{"word":"Kafilah","class":"n.","meaning":"See Cafila.","search":"kafilah"},
{"word":"Kaftan","class":"n & v.","meaning":"See Caftan.","search":"kaftan"},
{"word":"Kage","class":"n.","meaning":"A chantry chapel inclosed with lattice or screen work.","search":"kage"},
{"word":"Kagu","class":"n.","meaning":"A singular, crested, grallatorial bird (Rhinochetos jubatus), native of New Caledonia. It is gray above, paler beneath, and the feathers of the wings and tail are handsomely barred with brown, black, and gray. It is allied to the sun bittern.","search":"kagu"},
{"word":"Kaguan","class":"n.","meaning":"The colugo.","search":"kaguan"},
{"word":"Kahani","class":"n.","meaning":"A kind of notary public, or attorney, in the Levant.","search":"kahani"},
{"word":"Kahau","class":"n.","meaning":"A long-nosed monkey (Semnopithecus nasalis), native of Borneo. The general color of the body is bright chestnut, with the under parts, shoulders, and sides of the head, golden yellow, and the top of the head and upper part of the back brown. Called also proboscis monkey.","search":"kahau"},
{"word":"Kail","class":"n.","meaning":"A kind of headless cabbage. Same as Kale, 1.","search":"kail"},
{"word":"Kail","class":"n.","meaning":"Any cabbage, greens, or vegetables.","search":"kail"},
{"word":"Kail","class":"n.","meaning":"A broth made with kail or other vegetables; hence, any broth; also, a dinner.","search":"kail"},
{"word":"Kaimacam","class":"n.","meaning":"Same as Caimacam.","search":"kaimacam"},
{"word":"Kain","class":"n.","meaning":"Poultry, etc., required by the lease to be paid in kind by a tenant to his landlord.","search":"kain"},
{"word":"Kainit","class":"n.","meaning":"Salts of potassium used in the manufacture of fertilizers.","search":"kainit"},
{"word":"Kainite","class":"n.","meaning":"A compound salt consisting chiefly of potassium chloride and magnesium sulphate, occurring at the Stassfurt salt mines in Prussian Saxony.","search":"kainite"},
{"word":"Kainozoic","class":"a.","meaning":"See Cenozoic.","search":"kainozoic"},
{"word":"Kaique","class":"n.","meaning":"See Caique.","search":"kaique"},
{"word":"Kairine","class":"n.","meaning":"A pale buff or white crystalline alkaloid derived from quinoline, and used as an antipyretic in medicine.","search":"kairine"},
{"word":"Kairoline","class":"n.","meaning":"An organic base obtained from quinoline. It is used as a febrifuge, and resembles kairine.","search":"kairoline"},
{"word":"Kaiser","class":"n.","meaning":"The ancient title of emperors of Germany assumed by King William of Prussia when crowned sovereign of the new German empire in 1871.","search":"kaiser"},
{"word":"Kaka","class":"n.","meaning":"A New Zealand parrot of the genus Nestor, especially the brown parrot (Nestor meridionalis).","search":"kaka"},
{"word":"Kakapo","class":"n.","meaning":"A singular nocturnal parrot (Strigops habroptilus), native of New Zealand. It lives in holes during the day, but is active at night. It resembles an owl in its colors and general appearance. It has large wings, but can fly only a short distance. Called also owl parrot, night parrot, and night kaka.","search":"kakapo"},
{"word":"Kakaralli","class":"n.","meaning":"A kind of wood common in Demerara, durable in salt water, because not subject to the depredations of the sea worm and barnacle.","search":"kakaralli"},
{"word":"Kakistocracy","class":"n.","meaning":"Government by the worst men.","search":"kakistocracy"},
{"word":"Kakoxene","class":"n.","meaning":"See Cacoxene.","search":"kakoxene"},
{"word":"Kalan","class":"n.","meaning":"The sea otter.","search":"kalan"},
{"word":"Kalasie","class":"n.","meaning":"A long-tailed monkey of Borneo (Semnopithecus rubicundus). It has a tuft of long hair on the head.","search":"kalasie"},
{"word":"Kale","class":"n.","meaning":"A variety of cabbage in which the leaves do not form a head, being nearly the original or wild form of the species.","search":"kale"},
{"word":"Kale","class":"n.","meaning":"See Kail, 2.","search":"kale"},
{"word":"Kaleege","class":"n.","meaning":"One of several species of large, crested, Asiatic pheasants, belonging to the genus Euplocamus, and allied to the firebacks.","search":"kaleege"},
{"word":"Kaleidophon","class":"","meaning":"Alt. of Kaleidophone","search":"kaleidophon"},
{"word":"Kaleidophone","class":"","meaning":"An instrument invented by Professor Wheatstone, consisting of a reflecting knob at the end of a vibrating rod or thin plate, for making visible, in the motion of a point of light reflected from the knob, the paths or curves corresponding with the musical notes produced by the vibrations.","search":"kaleidophone"},
{"word":"Kaleidoscope","class":"n.","meaning":"An instrument invented by Sir David Brewster, which contains loose fragments of colored glass, etc., and reflecting surfaces so arranged that changes of position exhibit its contents in an endless variety of beautiful colors and symmetrical forms. It has been much employed in arts of design.","search":"kaleidoscope"},
{"word":"Kaleidoscopic","class":"a.","meaning":"Alt. of Kaleidoscopical","search":"kaleidoscopic"},
{"word":"Kaleidoscopical","class":"a.","meaning":"Of, pertaining to, or formed by, a kaleidoscope; variegated.","search":"kaleidoscopical"},
{"word":"Kalendar","class":"n.","meaning":"See Calendar.","search":"kalendar"},
{"word":"Kalendarial","class":"a.","meaning":"See Calendarial.","search":"kalendarial"},
{"word":"Kalender","class":"n.","meaning":"See 3d Calender.","search":"kalender"},
{"word":"Kalends","class":"n.","meaning":"Same as Calends.","search":"kalends"},
{"word":"Kali","class":"n.","meaning":"The last and worst of the four ages of the world; -- considered to have begun B. C. 3102, and to last 432,000 years.","search":"kali"},
{"word":"Kali","class":"n.","meaning":"The black, destroying goddess; -- called also Doorga, Anna Purna.","search":"kali"},
{"word":"Kali","class":"n.","meaning":"The glasswort (Salsola Kali).","search":"kali"},
{"word":"Kalif","class":"n.","meaning":"See Caliph.","search":"kalif"},
{"word":"Kaliform","class":"a.","meaning":"Formed like kali, or glasswort.","search":"kaliform"},
{"word":"Kaligenous","class":"a.","meaning":"Forming alkalies with oxygen, as some metals.","search":"kaligenous"},
{"word":"Kalium","class":"n.","meaning":"Potassium; -- so called by the German chemists.","search":"kalium"},
{"word":"Kalki","class":"n.","meaning":"The name of Vishnu in his tenth and last avatar.","search":"kalki"},
{"word":"Kalmia","class":"n.","meaning":"A genus of North American shrubs with poisonous evergreen foliage and corymbs of showy flowers. Called also mountain laurel, ivy bush, lamb kill, calico bush, etc.","search":"kalmia"},
{"word":"Kalmuck","class":"n.","meaning":"See Calmucks.","search":"kalmuck"},
{"word":"Kalmuck","class":"n.","meaning":"A kind of shaggy cloth, resembling bearskin.","search":"kalmuck"},
{"word":"Kalmuck","class":"n.","meaning":"A coarse, dyed, cotton cloth, made in Prussia.","search":"kalmuck"},
{"word":"Kalong","class":"n.","meaning":"A fruit bat, esp. the Indian edible fruit bat (Pteropus edulis).","search":"kalong"},
{"word":"Kaloyer","class":"n.","meaning":"See Caloyer.","search":"kaloyer"},
{"word":"Kalpa","class":"n.","meaning":"One of the Brahmanic eons, a period of 4,320,000,000 years. At the end of each Kalpa the world is annihilated.","search":"kalpa"},
{"word":"Kalsomine","class":"n. & v. t.","meaning":"Same as Calcimine.","search":"kalsomine"},
{"word":"Kam","class":"n.","meaning":"Crooked; awry.","search":"kam"},
{"word":"Kama","class":"n.","meaning":"The Hindoo Cupid. He is represented as a beautiful youth, with a bow of sugar cane or flowers.","search":"kama"},
{"word":"Kamala","class":"n.","meaning":"The red dusty hairs of the capsules of an East Indian tree (Mallotus Philippinensis) used for dyeing silk. It is violently emetic, and is used in the treatment of tapeworm.","search":"kamala"},
{"word":"Kame","class":"n.","meaning":"A low ridge.","search":"kame"},
{"word":"Kami","class":"n. pl.","meaning":"A title given to the celestial gods of the first mythical dynasty of Japan and extended to the demigods of the second dynasty, and then to the long line of spiritual princes still represented by the mikado.","search":"kami"},
{"word":"Kamichi","class":"n.","meaning":"A curious South American bird (Anhima, / Palamedea, cornuta), often domesticated by the natives and kept with poultry, which it defends against birds of prey. It has a long, slender, hornlike ornament on its head, and two sharp spurs on each wing. Although its beak, feet, and legs resemble those of gallinaceous birds, it is related in anatomical characters to the ducks and geese (Anseres). Called also horned screamer. The name is sometimes applied also to the chaja. See Chaja, and Screamer.","search":"kamichi"},
{"word":"Kamptulicon","class":"n.","meaning":"A kind of elastic floor cloth, made of India rubber, gutta-percha, linseed oil, and powdered cork.","search":"kamptulicon"},
{"word":"Kampylite","class":"n.","meaning":"A variety of mimetite or arseniate of lead in hexagonal prisms of a fine orange yellow.","search":"kampylite"},
{"word":"Kamsin","class":"n.","meaning":"Alt. of Khamsin","search":"kamsin"},
{"word":"Khamsin","class":"n.","meaning":"A hot southwesterly wind in Egypt, coming from the Sahara.","search":"khamsin"},
{"word":"Kamtschadales","class":"n. pl.","meaning":"An aboriginal tribe inhabiting the southern part of Kamtschatka.","search":"kamtschadales"},
{"word":"Kan","class":"v. t.","meaning":"To know; to ken.","search":"kan"},
{"word":"Kan","class":"n.","meaning":"See Khan.","search":"kan"},
{"word":"Kanacka","class":"n.","meaning":"Alt. of Kanaka","search":"kanacka"},
{"word":"Kanaka","class":"n.","meaning":"A native of the Sandwich Islands.","search":"kanaka"},
{"word":"Kanchil","class":"n.","meaning":"A small chevrotain of the genus Tragulus, esp. T. pygmaeus, or T. kanchil, inhabiting Java, Sumatra, and adjacent islands; a deerlet. It is noted for its agility and cunning.","search":"kanchil"},
{"word":"Kand","class":"n.","meaning":"Fluor spar; -- so called by Cornish miners.","search":"kand"},
{"word":"Kangaroo","class":"n.","meaning":"Any one of numerous species of jumping marsupials of the family Macropodidae. They inhabit Australia, New Guinea, and adjacent islands, They have long and strong hind legs and a large tail, while the fore legs are comparatively short and feeble. The giant kangaroo (Macropus major) is the largest species, sometimes becoming twelve or fourteen feet in total length. The tree kangaroos, belonging to the genus Dendrolagus, live in trees; the rock kangaroos, of the genus Petrogale, inhabit rocky situations; and the brush kangaroos, of the genus Halmaturus, inhabit wooded districts. See Wallaby.","search":"kangaroo"},
{"word":"Kansas","class":"n. pl.","meaning":"A tribe of Indians allied to the Winnebagoes and Osages. They formerly inhabited the region which is now the State of Kansas, but were removed to the Indian Territory.","search":"kansas"},
{"word":"Kantian","class":"a.","meaning":"Of or pertaining to Immanuel Kant, the German philosopher; conformed or relating to any or all of the philosophical doctrines of Immanuel Kant.","search":"kantian"},
{"word":"Kantian","class":"n.","meaning":"A follower of Kant; a Kantist.","search":"kantian"},
{"word":"Kantianism","class":"n.","meaning":"Alt. of Kantism","search":"kantianism"},
{"word":"Kantism","class":"n.","meaning":"The doctrine or theory of Kant; the Kantian philosophy.","search":"kantism"},
{"word":"Kantist","class":"n.","meaning":"A disciple or follower of Kant.","search":"kantist"},
{"word":"Kanttry","class":"n.","meaning":"Same as Cantred.","search":"kanttry"},
{"word":"Kaolin","class":"n.","meaning":"Alt. of Kaoline","search":"kaolin"},
{"word":"Kaoline","class":"n.","meaning":"A very pure white clay, ordinarily in the form of an impalpable powder, and used to form the paste of porcelain; China clay; porcelain clay. It is chiefly derived from the decomposition of common feldspar.","search":"kaoline"},
{"word":"Kaolinization","class":"n.","meaning":"The process by which feldspar is changed into kaolin.","search":"kaolinization"},
{"word":"Kaolinize","class":"v. t.","meaning":"To convert into kaolin.","search":"kaolinize"},
{"word":"Kapelle","class":"n.","meaning":"A chapel; hence, the choir or orchestra of a prince's chapel; now, a musical establishment, usually orchestral.","search":"kapelle"},
{"word":"Kapellmeister","class":"n.","meaning":"See Capellmeister.","search":"kapellmeister"},
{"word":"Kapia","class":"n.","meaning":"The fossil resin of the kauri tree of New Zealand.","search":"kapia"},
{"word":"Kapnomar","class":"n. Chem.","meaning":") See Capnomor.","search":"kapnomar"},
{"word":"Karagane","class":"n.","meaning":"A species of gray fox found in Russia.","search":"karagane"},
{"word":"Karaism","class":"n.","meaning":"Doctrines of the Karaites.","search":"karaism"},
{"word":"Karaite","class":"n.","meaning":"A sect of Jews who adhere closely to the letter of the Scriptures, rejecting the oral law, and allowing the Talmud no binding authority; -- opposed to the Rabbinists.","search":"karaite"},
{"word":"Karatas","class":"n.","meaning":"A West Indian plant of the Pineapple family (Nidularium Karatas).","search":"karatas"},
{"word":"Karma","class":"n.","meaning":"One's acts considered as fixing one's lot in the future existence. (Theos.) The doctrine of fate as the inflexible result of cause and effect; the theory of inevitable consequence.","search":"karma"},
{"word":"Karmathian","class":"n.","meaning":"One of a Mohammedan sect founded in the ninth century by Karmat.","search":"karmathian"},
{"word":"Karn","class":"n.","meaning":"A pile of rocks; sometimes, the solid rock. See Cairn.","search":"karn"},
{"word":"Karob","class":"n.","meaning":"The twenty-fourth part of a grain; -- a weight used by goldsmiths.","search":"karob"},
{"word":"Karpholite","class":"n.","meaning":"A fibrous mineral occurring in tufts of a straw-yellow color. It is a hydrous silicate of alumina and manganese.","search":"karpholite"},
{"word":"Karroos","class":"pl. ","meaning":"of Karreo","search":"karroos"},
{"word":"Karreo","class":"n.","meaning":"One of the dry table-lands of South Africa, which often rise terracelike to considerable elevations.","search":"karreo"},
{"word":"Karstenite","class":"n.","meaning":"Same as Anhydrite.","search":"karstenite"},
{"word":"Karvel","class":"n.","meaning":"See Carvel, and Caravel.","search":"karvel"},
{"word":"Karyokinesis","class":"n.","meaning":"The indirect division of cells in which, prior to division of the cell protoplasm, complicated changes take place in the nucleus, attended with movement of the nuclear fibrils; -- opposed to karyostenosis. The nucleus becomes enlarged and convoluted, and finally the threads are separated into two groups which ultimately become disconnected and constitute the daughter nuclei. Called also mitosis. See Cell development, under Cell.","search":"karyokinesis"},
{"word":"Karyokinetic","class":"a.","meaning":"Of or pertaining to karyokinesis; as, karyokinetic changes of cell division.","search":"karyokinetic"},
{"word":"Karyomiton","class":"n.","meaning":"The reticular network of fine fibers, of which the nucleus of a cell is in part composed; -- in opposition to kytomiton, or the network in the body of the cell.","search":"karyomiton"},
{"word":"Karyoplasma","class":"n.","meaning":"The protoplasmic substance of the nucleus of a cell: nucleoplasm; -- in opposition to kytoplasma, the protoplasm of the cell.","search":"karyoplasma"},
{"word":"Karyostenosis","class":"n.","meaning":"Direct cell division (in which there is first a simple division of the nucleus, without any changes in its structure, followed by division of the protoplasm of the karyostenotic mode of nuclear division.","search":"karyostenosis"},
{"word":"Kasack","class":"n.","meaning":"Same as Cossack.","search":"kasack"},
{"word":"Kat","class":"n.","meaning":"An Arabian shrub Catha edulis) the leaves of which are used as tea by the Arabs.","search":"kat"},
{"word":"Katabolic","class":"a.","meaning":"Of or pertaining to katabolism; as, katabolic processes, which give rise to substances (katastates) of decreasing complexity and increasing stability.","search":"katabolic"},
{"word":"Katabolism","class":"n.","meaning":"Destructive or downward metabolism; regressive metamorphism; -- opposed to anabolism. See Disassimilation.","search":"katabolism"},
{"word":"Katastate","class":"n.","meaning":"(Physiol.) A substance formed by a katabolic process; -- opposed to anastate. See Katabolic.","search":"katastate"},
{"word":"Kate","class":"n.","meaning":"The brambling finch.","search":"kate"},
{"word":"Kathetal","class":"a.","meaning":"Making a right angle; perpendicular, as two lines or two sides of a triangle, which include a right angle.","search":"kathetal"},
{"word":"Kathetometer","class":"n.","meaning":"Same as Cathetometer.","search":"kathetometer"},
{"word":"Kattinumdoo","class":"n.","meaning":"A caoutchouc like substance obtained from the milky juice of the East Indian Euphorbia Kattimundoo. It is used as a cement.","search":"kattinumdoo"},
{"word":"Katydid","class":"n.","meaning":"A large, green, arboreal, orthopterous insect (Cyrtophyllus concavus) of the family Locustidae, common in the United States. The males have stridulating organs at the bases of the front wings. During the summer and autumn, in the evening, the males make a peculiar, loud, shrill sound, resembling the combination Katy-did, whence the name.","search":"katydid"},
{"word":"Kauri","class":"n.","meaning":"A lofty coniferous tree of New Zealand Agathis, / Dammara, australis), furnishing valuable timber and yielding one kind of dammar resin.","search":"kauri"},
{"word":"Kava","class":"n.","meaning":"A species of Macropiper (M. methysticum), the long pepper, from the root of which an intoxicating beverage is made by the Polynesians, by a process of mastication; also, the beverage itself.","search":"kava"},
{"word":"Kavasses","class":"pl. ","meaning":"of Kavass","search":"kavasses"},
{"word":"Kavass","class":"n.","meaning":"An armed constable; also, a government servant or courier.","search":"kavass"},
{"word":"Kaw","class":"v. i. & n.","meaning":"See Caw.","search":"kaw"},
{"word":"Kawaka","class":"n.","meaning":"a New Zealand tree, the Cypress cedar (Libocedrus Doniana), having a valuable, fine-grained, reddish wood.","search":"kawaka"},
{"word":"Kawn","class":"n.","meaning":"An inn.","search":"kawn"},
{"word":"Kayak","class":"n.","meaning":"A light canoe, made of skins stretched over a frame, and usually capable of carrying but one person, who sits amidships and uses a double-bladed paddle. It is peculiar to the Eskimos and other Arctic tribes.","search":"kayak"},
{"word":"Kayaker","class":"n.","meaning":"One who uses a kayak.","search":"kayaker"},
{"word":"Kayko","class":"n.","meaning":"The dog salmon.","search":"kayko"},
{"word":"Kayles","class":"n. pl.","meaning":"A game; ninepins.","search":"kayles"},
{"word":"Kaynard","class":"n.","meaning":"A lazy or cowardly person; a rascal.","search":"kaynard"},
{"word":"Kecked","class":"imp. & p. p.","meaning":"of Keck","search":"kecked"},
{"word":"Kecking","class":"p. pr. & vb. n.","meaning":"of Keck","search":"kecking"},
{"word":"Keck","class":"v. i.","meaning":"To heave or to retch, as in an effort to vomit.","search":"keck"},
{"word":"Keck","class":"n.","meaning":"An effort to vomit; queasiness.","search":"keck"},
{"word":"Keckle","class":"v. i. & n.","meaning":"See Keck, v. i. &amp; n.","search":"keckle"},
{"word":"Keckled","class":"imp. & p. p.","meaning":"of Keckle","search":"keckled"},
{"word":"Keckling","class":"p. pr. & vb. n.","meaning":"of Keckle","search":"keckling"},
{"word":"Keckle","class":"v. t.","meaning":"To wind old rope around, as a cable, to preserve its surface from being fretted, or to wind iron chains around, to defend from the friction of a rocky bottom, or from the ice.","search":"keckle"},
{"word":"Keckling","class":"n.","meaning":"Old rope or iron chains wound around a cable. See Keckle, v. t.","search":"keckling"},
{"word":"Kecklish","class":"a.","meaning":"Inclined to vomit; squeamish.","search":"kecklish"},
{"word":"Kecksies","class":"pl. ","meaning":"of Kecksy","search":"kecksies"},
{"word":"Kecksy","class":"n.","meaning":"The hollow stalk of an umbelliferous plant, such as the cow parsnip or the hemlock.","search":"kecksy"},
{"word":"Kecky","class":"a.","meaning":"Resembling a kecksy.","search":"kecky"},
{"word":"Kedged","class":"imp. & p. p.","meaning":"of Kedge","search":"kedged"},
{"word":"Kedging","class":"p. pr. & vb. n.","meaning":"of Kedge","search":"kedging"},
{"word":"Kedge","class":"n.","meaning":"To move (a vessel) by carrying out a kedge in a boat, dropping it overboard, and hauling the vessel up to it.","search":"kedge"},
{"word":"Kedge","class":"v. t.","meaning":"A small anchor used whenever a large one can be dispensed witch. See Kedge, v. t., and Anchor, n.","search":"kedge"},
{"word":"Kedger","class":"n.","meaning":"A small anchor; a kedge.","search":"kedger"},
{"word":"Kedlook","class":"n.","meaning":"See Charlock.","search":"kedlook"},
{"word":"Kee","class":"n. pl.","meaning":"See Kie, Ky, and Kine.","search":"kee"},
{"word":"Keech","class":"n.","meaning":"A mass or lump of fat rolled up by the butcher.","search":"keech"},
{"word":"Keel","class":"v. t. & i.","meaning":"To cool; to skim or stir.","search":"keel"},
{"word":"Keel","class":"n.","meaning":"A brewer's cooling vat; a keelfat.","search":"keel"},
{"word":"Keel","class":"n.","meaning":"A longitudinal timber, or series of timbers scarfed together, extending from stem to stern along the bottom of a vessel. It is the principal timber of the vessel, and, by means of the ribs attached on each side, supports the vessel's frame. In an iron vessel, a combination of plates supplies the place of the keel of a wooden ship. See Illust. of Keelson.","search":"keel"},
{"word":"Keel","class":"n.","meaning":"Fig.: The whole ship.","search":"keel"},
{"word":"Keel","class":"n.","meaning":"A barge or lighter, used on the Type for carrying coal from Newcastle; also, a barge load of coal, twenty-one tons, four cwt.","search":"keel"},
{"word":"Keel","class":"n.","meaning":"The two lowest petals of the corolla of a papilionaceous flower, united and inclosing the stamens and pistil; a carina. See Carina.","search":"keel"},
{"word":"Keel","class":"n.","meaning":"A projecting ridge along the middle of a flat or curved surface.","search":"keel"},
{"word":"Keeled","class":"imp. & p. p.","meaning":"of Keel","search":"keeled"},
{"word":"Keeling","class":"p. pr. & vb. n.","meaning":"of Keel","search":"keeling"},
{"word":"Keel","class":"v. i.","meaning":"To traverse with a keel; to navigate.","search":"keel"},
{"word":"Keel","class":"v. i.","meaning":"To turn up the keel; to show the bottom.","search":"keel"},
{"word":"Keelage","class":"n.","meaning":"The right of demanding a duty or toll for a ship entering a port; also, the duty or toll.","search":"keelage"},
{"word":"Keeled","class":"a.","meaning":"Keel-shaped; having a longitudinal prominence on the back; as, a keeled leaf.","search":"keeled"},
{"word":"Keeled","class":"a.","meaning":"Having a median ridge; carinate; as, a keeled scale.","search":"keeled"},
{"word":"Keeler","class":"n.","meaning":"One employed in managing a Newcastle keel; -- called also keelman.","search":"keeler"},
{"word":"Keeler","class":"n.","meaning":"A small or shallow tub; esp., one used for holding materials for calking ships, or one used for washing dishes, etc.","search":"keeler"},
{"word":"Keelfat","class":"n.","meaning":"A cooler; a vat for cooling wort, etc.","search":"keelfat"},
{"word":"Keelhauled","class":"imp. & p. p.","meaning":"of Keelhaul","search":"keelhauled"},
{"word":"Keelhauling","class":"p. pr. & vb. n.","meaning":"of Keelhaul","search":"keelhauling"},
{"word":"Keelhaul","class":"v. i.","meaning":"To haul under the keel of a ship, by ropes attached to the yardarms on each side. It was formerly practiced as a punishment in the Dutch and English navies.","search":"keelhaul"},
{"word":"Keeling","class":"n.","meaning":"A cod.","search":"keeling"},
{"word":"Keelivine","class":"n.","meaning":"A pencil of black or red lead; -- called also keelyvine pen.","search":"keelivine"},
{"word":"Keelman","class":"n.","meaning":"See Keeler, 1.","search":"keelman"},
{"word":"Keelrake","class":"v. t.","meaning":"Same as Keelhaul.","search":"keelrake"},
{"word":"Keels","class":"n. pl.","meaning":"Ninepins. See Kayles.","search":"keels"},
{"word":"Keelson","class":"n.","meaning":"A piece of timber in a ship laid on the middle of the floor timbers over the keel, and binding the floor timbers to the keel; in iron vessels, a structure of plates, situated like the keelson of a timber ship.","search":"keelson"},
{"word":"Keelvat","class":"n.","meaning":"See Keelfat.","search":"keelvat"},
{"word":"Keen","class":"superl.","meaning":"Sharp; having a fine edge or point; as, a keen razor, or a razor with a keen edge.","search":"keen"},
{"word":"Keen","class":"superl.","meaning":"Acute of mind; sharp; penetrating; having or expressing mental acuteness; as, a man of keen understanding; a keen look; keen features.","search":"keen"},
{"word":"Keen","class":"superl.","meaning":"Bitter; piercing; acrimonious; cutting; stinging; severe; as, keen satire or sarcasm.","search":"keen"},
{"word":"Keen","class":"superl.","meaning":"Piercing; penetrating; cutting; sharp; -- applied to cold, wind, etc, ; as, a keen wind; the cold is very keen.","search":"keen"},
{"word":"Keen","class":"superl.","meaning":"Eager; vehement; fierce; as, a keen appetite.","search":"keen"},
{"word":"Keen","class":"v. t.","meaning":"To sharpen; to make cold.","search":"keen"},
{"word":"Keen","class":"n.","meaning":"A prolonged wail for a deceased person.  Cf. Coranach.","search":"keen"},
{"word":"Keen","class":"v. i.","meaning":"To wail as a keener does.","search":"keen"},
{"word":"Keener","class":"n.","meaning":"A professional mourner who wails at a funeral.","search":"keener"},
{"word":"Keenly","class":"adv.","meaning":"In a keen manner.","search":"keenly"},
{"word":"Keenness","class":"n.","meaning":"The quality or state of being keen.","search":"keenness"},
{"word":"Kept","class":"imp. & p. p.","meaning":"of Keep","search":"kept"},
{"word":"Keeping","class":"p. pr. & vb. n.","meaning":"of Keep","search":"keeping"},
{"word":"Keep","class":"v. t.","meaning":"To care; to desire.","search":"keep"},
{"word":"Keep","class":"v. t.","meaning":"To hold; to restrain from departure or removal; not to let go of; to retain in one's power or possession; not to lose; to retain; to detain.","search":"keep"},
{"word":"Keep","class":"v. t.","meaning":"To cause to remain in a given situation or condition; to maintain unchanged; to hold or preserve in any state or tenor.","search":"keep"},
{"word":"Keep","class":"v. t.","meaning":"To have in custody; to have in some place for preservation; to take charge of.","search":"keep"},
{"word":"Keep","class":"v. t.","meaning":"To preserve from danger, harm, or loss; to guard.","search":"keep"},
{"word":"Keep","class":"v. t.","meaning":"To preserve from discovery or publicity; not to communicate, reveal, or betray, as a secret.","search":"keep"},
{"word":"Keep","class":"v. t.","meaning":"To attend upon; to have the care of; to tend.","search":"keep"},
{"word":"Keep","class":"v. t.","meaning":"To record transactions, accounts, or events in; as, to keep books, a journal, etc.  ; also, to enter (as accounts, records, etc. ) in a book.","search":"keep"},
{"word":"Keep","class":"v. t.","meaning":"To maintain, as an establishment, institution, or the like; to conduct; to manage; as, to keep store.","search":"keep"},
{"word":"Keep","class":"v. t.","meaning":"To supply with necessaries of life; to entertain; as, to keep boarders.","search":"keep"},
{"word":"Keep","class":"v. t.","meaning":"To have in one's service; to have and maintain, as an assistant, a servant, a mistress, a horse, etc.","search":"keep"},
{"word":"Keep","class":"v. t.","meaning":"To have habitually in stock for sale.","search":"keep"},
{"word":"Keep","class":"v. t.","meaning":"To continue in, as a course or mode of action; not to intermit or fall from; to hold to; to maintain; as, to keep silence; to keep one's word; to keep possession.","search":"keep"},
{"word":"Keep","class":"v. t.","meaning":"To observe; to adhere to; to fulfill; not to swerve from or violate; to practice or perform, as duty; not to neglect; to be faithful to.","search":"keep"},
{"word":"Keep","class":"v. t.","meaning":"To confine one's self to; not to quit; to remain in; as, to keep one's house, room, bed, etc.  ; hence, to haunt; to frequent.","search":"keep"},
{"word":"Keep","class":"v. t.","meaning":"To observe duty, as a festival, etc. ; to celebrate; to solemnize; as, to keep a feast.","search":"keep"},
{"word":"Keep","class":"v. i.","meaning":"To remain in any position or state; to continue; to abide; to stay; as, to keep at a distance; to keep aloft; to keep near; to keep in the house; to keep before or behind; to keep in favor; to keep out of company, or out reach.","search":"keep"},
{"word":"Keep","class":"v. i.","meaning":"To last; to endure; to remain unimpaired.","search":"keep"},
{"word":"Keep","class":"v. i.","meaning":"To reside for a time; to lodge; to dwell.","search":"keep"},
{"word":"Keep","class":"v. i.","meaning":"To take care; to be solicitous; to watch.","search":"keep"},
{"word":"Keep","class":"v. i.","meaning":"To be in session; as, school keeps to-day.","search":"keep"},
{"word":"Keep","class":"n.","meaning":"The act or office of keeping; custody; guard; care; heed; charge.","search":"keep"},
{"word":"Keep","class":"n.","meaning":"The state of being kept; hence, the resulting condition; case; as, to be in good keep.","search":"keep"},
{"word":"Keep","class":"n.","meaning":"The means or provisions by which one is kept; maintenance; support; as, the keep of a horse.","search":"keep"},
{"word":"Keep","class":"n.","meaning":"That which keeps or protects; a stronghold; a fortress; a castle; specifically, the strongest and securest part of a castle, often used as a place of residence by the lord of the castle, especially during a siege; the donjon. See Illust. of Castle.","search":"keep"},
{"word":"Keep","class":"n.","meaning":"That which is kept in charge; a charge.","search":"keep"},
{"word":"Keep","class":"n.","meaning":"A cap for retaining anything, as a journal box, in place.","search":"keep"},
{"word":"Keeper","class":"n.","meaning":"One who, or that which, keeps; one who, or that which, holds or has possession of anything.","search":"keeper"},
{"word":"Keeper","class":"n.","meaning":"One who retains in custody; one who has the care of a prison and the charge of prisoners.","search":"keeper"},
{"word":"Keeper","class":"n.","meaning":"One who has the care, custody, or superintendence of anything; as, the keeper of a park, a pound, of sheep, of a gate, etc.  ; the keeper of attached property; hence, one who saves from harm; a defender; a preserver.","search":"keeper"},
{"word":"Keeper","class":"n.","meaning":"One who remains or keeps in a place or position.","search":"keeper"},
{"word":"Keeper","class":"n.","meaning":"A ring, strap, clamp, or any device for holding an object in place; as: (a) The box on a door jamb into which the bolt of a lock protrudes, when shot. (b) A ring serving to keep another ring on the finger. (c) A loop near the buckle of a strap to receive the end of the strap.","search":"keeper"},
{"word":"Keeper","class":"n.","meaning":"A fruit that keeps well; as, the Roxbury Russet is a good keeper.","search":"keeper"},
{"word":"Keepership","class":"n.","meaning":"The office or position of a keeper.","search":"keepership"},
{"word":"Keeping","class":"n.","meaning":"A holding; restraint; custody; guard; charge; care; preservation.","search":"keeping"},
{"word":"Keeping","class":"n.","meaning":"Maintenance; support; provision; feed; as, the cattle have good keeping.","search":"keeping"},
{"word":"Keeping","class":"n.","meaning":"Conformity; congruity; harmony; consistency; as, these subjects are in keeping with each other.","search":"keeping"},
{"word":"Keeping","class":"n.","meaning":"Harmony or correspondence between the different parts of a work of art; as, the foreground of this painting is not in keeping.","search":"keeping"},
{"word":"Keepsake","class":"n.","meaning":"Anything kept, or given to be kept, for the sake of the giver; a token of friendship.","search":"keepsake"},
{"word":"Keesh","class":"n.","meaning":"See Kish.","search":"keesh"},
{"word":"Keeve","class":"n.","meaning":"A vat or tub in which the mash is made; a mash tub.","search":"keeve"},
{"word":"Keeve","class":"n.","meaning":"A bleaching vat; a kier.","search":"keeve"},
{"word":"Keeve","class":"n.","meaning":"A large vat used in dressing ores.","search":"keeve"},
{"word":"Keeved","class":"imp. & p. p.","meaning":"of Keeve","search":"keeved"},
{"word":"Keeving","class":"p. pr. & vb. n.","meaning":"of Keeve","search":"keeving"},
{"word":"Keeve","class":"v. t.","meaning":"To set in a keeve, or tub, for fermentation.","search":"keeve"},
{"word":"Keeve","class":"v. t.","meaning":"To heave; to tilt, as a cart.","search":"keeve"},
{"word":"Keever","class":"n.","meaning":"See Keeve, n.","search":"keever"},
{"word":"Keffe-kil","class":"n.","meaning":"See Kiefekil.","search":"keffe-kil"},
{"word":"Keg","class":"n.","meaning":"A small cask or barrel.","search":"keg"},
{"word":"Keilhau-ite","class":"n.","meaning":"A mineral of a brownish black color, related to titanite in form. It consists chiefly of silica, titanium dioxide, lime, and yttria.","search":"keilhau-ite"},
{"word":"Keir","class":"n.","meaning":"See Kier.","search":"keir"},
{"word":"Keitloa","class":"n.","meaning":"A black, two-horned, African rhinoceros (Atelodus keitloa). It has the posterior horn about as long as the anterior one, or even longer.","search":"keitloa"},
{"word":"Keld","class":"a.","meaning":"Having a kell or covering; webbed.","search":"keld"},
{"word":"Kele","class":"v. t.","meaning":"To cool.","search":"kele"},
{"word":"Kell","class":"n.","meaning":"A kiln.","search":"kell"},
{"word":"Kell","class":"n.","meaning":"A sort of pottage; kale. See Kale, 2.","search":"kell"},
{"word":"Kell","class":"n.","meaning":"The caul; that which covers or envelops as a caul; a net; a fold; a film.","search":"kell"},
{"word":"Kell","class":"n.","meaning":"The cocoon or chrysalis of an insect.","search":"kell"},
{"word":"Keloid","class":"a.","meaning":"Applied to a variety of tumor forming hard, flat, irregular excrescences upon the skin.","search":"keloid"},
{"word":"Keloid","class":"n.","meaning":"A keloid tumor.","search":"keloid"},
{"word":"Kelotomy","class":"n.","meaning":"See Celotomy.","search":"kelotomy"},
{"word":"Kelp","class":"n.","meaning":"The calcined ashes of seaweed, -- formerly much used in the manufacture of glass, now used in the manufacture of iodine.","search":"kelp"},
{"word":"Kelp","class":"n.","meaning":"Any large blackish seaweed.","search":"kelp"},
{"word":"Kelpfish","class":"n.","meaning":"A small California food fish (Heterostichus rostratus), living among kelp. The name is also applied to species of the genus Platyglossus.","search":"kelpfish"},
{"word":"Kelpies","class":"pl. ","meaning":"of Kelpy","search":"kelpies"},
{"word":"Kelpie","class":"n.","meaning":"Alt. of Kelpy","search":"kelpie"},
{"word":"Kelpy","class":"n.","meaning":"An imaginary spirit of the waters, horselike in form, vulgarly believed to warn, by preternatural noises and lights, those who are to be drowned.","search":"kelpy"},
{"word":"Kelpware","class":"n.","meaning":"Same as Kelp, 2.","search":"kelpware"},
{"word":"Kelson","class":"n.","meaning":"See Keelson.","search":"kelson"},
{"word":"Kelt","class":"n.","meaning":"See Kilt, n.","search":"kelt"},
{"word":"Kelt","class":"n.","meaning":"Cloth with the nap, generally of native black wool.","search":"kelt"},
{"word":"Kelt","class":"n.","meaning":"A salmon after spawning.","search":"kelt"},
{"word":"Kelt","class":"n.","meaning":"Same as Celt, one of Celtic race.","search":"kelt"},
{"word":"Kelter","class":"n.","meaning":"Regular order or proper condition.","search":"kelter"},
{"word":"Keltic","class":"a. & n.","meaning":"Same as Celtic, a. &amp; n.","search":"keltic"},
{"word":"Kembed","class":"imp. & p. p.","meaning":"of Kemb","search":"kembed"},
{"word":"Kempt","class":"","meaning":"of Kemb","search":"kempt"},
{"word":"Kembing","class":"p. pr. & vb. n.","meaning":"of Kemb","search":"kembing"},
{"word":"Kemb","class":"v. t.","meaning":"To comb.","search":"kemb"},
{"word":"Kemelin","class":"n.","meaning":"A tub; a brewer's vessel.","search":"kemelin"},
{"word":"Kemp","class":"n.","meaning":"Alt. of Kempty","search":"kemp"},
{"word":"Kempty","class":"n.","meaning":"Coarse, rough hair wool or fur, injuring its quality.","search":"kempty"},
{"word":"Kempe","class":"a.","meaning":"Rough; shaggy.","search":"kempe"},
{"word":"Kemps","class":"n. pl.","meaning":"The long flower stems of the ribwort plantain (Plantago Lanceolata).","search":"kemps"},
{"word":"Kempt","class":"","meaning":"p. p. of Kemb.","search":"kempt"},
{"word":"Ken","class":"n.","meaning":"A house; esp., one which is a resort for thieves.","search":"ken"},
{"word":"Kenned","class":"imp. & p. p.","meaning":"of Ken","search":"kenned"},
{"word":"Kenning","class":"p. pr. & vb. n.","meaning":"of Ken","search":"kenning"},
{"word":"Ken","class":"n. t.","meaning":"To know; to understand; to take cognizance of.","search":"ken"},
{"word":"Ken","class":"n. t.","meaning":"To recognize; to descry; to discern.","search":"ken"},
{"word":"Ken","class":"v. i.","meaning":"To look around.","search":"ken"},
{"word":"Ken","class":"n.","meaning":"Cognizance; view; especially, reach of sight or knowledge.","search":"ken"},
{"word":"Kendal green","class":"","meaning":"Alt. of Kendal","search":"kendal green"},
{"word":"Kendal","class":"","meaning":"A cloth colored green by dye obtained from the woad-waxen, formerly used by Flemish weavers at Kendal, in Westmoreland, England.","search":"kendal"},
{"word":"Kennel","class":"n.","meaning":"The water course of a street; a little canal or channel; a gutter; also, a puddle.","search":"kennel"},
{"word":"Kennel","class":"n.","meaning":"A house for a dog or for dogs, or for a pack of hounds.","search":"kennel"},
{"word":"Kennel","class":"n.","meaning":"A pack of hounds, or a collection of dogs.","search":"kennel"},
{"word":"Kennel","class":"n.","meaning":"The hole of a fox or other beast; a haunt.","search":"kennel"},
{"word":"Kenneled","class":"imp. & p. p.","meaning":"of Kennel","search":"kenneled"},
{"word":"Kennelled","class":"","meaning":"of Kennel","search":"kennelled"},
{"word":"Kennelling","class":"p. pr. & vb. n.","meaning":"of Kennel","search":"kennelling"},
{"word":"Kennel","class":"v. i.","meaning":"To lie or lodge; to dwell, as a dog or a fox.","search":"kennel"},
{"word":"Kennel","class":"v. t.","meaning":"To put or keep in a kennel.","search":"kennel"},
{"word":"Kennel coal","class":"","meaning":"See Cannel coal.","search":"kennel coal"},
{"word":"Kenning","class":"v. t.","meaning":"Range of sight.","search":"kenning"},
{"word":"Kenning","class":"v. t.","meaning":"The limit of vision at sea, being a distance of about twenty miles.","search":"kenning"},
{"word":"Keno","class":"n.","meaning":"A gambling game, a variety of the game of lotto, played with balls or knobs, numbered, and cards also numbered.","search":"keno"},
{"word":"Kenogenesis","class":"n.","meaning":"Modified evolution, in which nonprimitive characters make their appearance in consequence of a secondary adaptation of the embryo to the peculiar conditions of its environment; -- distinguished from palingenesis.","search":"kenogenesis"},
{"word":"Kenogenetic","class":"a.","meaning":"Of or pertaining to kenogenesis; as, kenogenetic processes.","search":"kenogenetic"},
{"word":"Kenspeckle","class":"a.","meaning":"Having so marked an appearance as easily to be recognized.","search":"kenspeckle"},
{"word":"Kent bugle","class":"","meaning":"A curved bugle, having six finger keys or stops, by means of which the performer can play upon every key in the musical scale; -- called also keyed bugle, and key bugle.","search":"kent bugle"},
{"word":"Kentle","class":"n.","meaning":"A hundred weight; a quintal.","search":"kentle"},
{"word":"Kentledge","class":"n.","meaning":"Pigs of iron used for ballast.","search":"kentledge"},
{"word":"Kentucky","class":"n.","meaning":"One of the United States.","search":"kentucky"},
{"word":"Kephalin","class":"n.","meaning":"One of a group of nitrogenous phosphorized principles, supposed by Thudichum to exist in brain tissue.","search":"kephalin"},
{"word":"Kept","class":"imp. & p. p.","meaning":"of Keep.","search":"kept"},
{"word":"Keramic","class":"a.","meaning":"Same as Ceramic.","search":"keramic"},
{"word":"Keramics","class":"n.","meaning":"Same as Ceramics.","search":"keramics"},
{"word":"Keramographic","class":"a.","meaning":"Suitable to be written upon; capable of being written upon, as a slate; -- said especially of a certain kind of globe.","search":"keramographic"},
{"word":"Kerana","class":"n.","meaning":"A kind of long trumpet, used among the Persians.","search":"kerana"},
{"word":"Kerargyrite","class":"n.","meaning":"See Cerargyrite.","search":"kerargyrite"},
{"word":"Kerasin","class":"n.","meaning":"A nitrogenous substance free from phosphorus, supposed to be present in the brain; a body closely related to cerebrin.","search":"kerasin"},
{"word":"Kerasine","class":"a.","meaning":"Resembling horn; horny; corneous.","search":"kerasine"},
{"word":"Keratin","class":"n.","meaning":"A nitrogenous substance, or mixture of substances, containing sulphur in a loose state of combination, and forming the chemical basis of epidermal tissues, such as horn, hair, feathers, and the like. It is an insoluble substance, and, unlike elastin, is not dissolved even by gastric or pancreatic juice. By decomposition with sulphuric acid it yields leucin and tyrosin, as does albumin. Called also epidermose.","search":"keratin"},
{"word":"Keratitis","class":"n.","meaning":"Inflammation of the cornea.","search":"keratitis"},
{"word":"Keratode","class":"n.","meaning":"See Keratose.","search":"keratode"},
{"word":"Keratogenous","class":"a.","meaning":"Producing horn; as, the keratogenous membrane within the horny hoof of the horse.","search":"keratogenous"},
{"word":"Keratoidea","class":"n. pl.","meaning":"Same as Keratosa.","search":"keratoidea"},
{"word":"Keratome","class":"n.","meaning":"An instrument for dividing the cornea in operations for cataract.","search":"keratome"},
{"word":"Keratonyxis","class":"n.","meaning":"The operation of removing a cataract by thrusting a needle through the cornea of the eye, and breaking up the opaque mass.","search":"keratonyxis"},
{"word":"Keratophyte","class":"n.","meaning":"A gorgonian coral having a horny axis.","search":"keratophyte"},
{"word":"Keratosa","class":"n. pl.","meaning":"An order of sponges having a skeleton composed of hornlike fibers. It includes the commercial sponges.","search":"keratosa"},
{"word":"Keratose","class":"n.","meaning":"A tough, horny animal substance entering into the composition of the skeleton of sponges, and other invertebrates; -- called also keratode.","search":"keratose"},
{"word":"Keratose","class":"a.","meaning":"Containing hornlike fibers or fibers of keratose; belonging to the Keratosa.","search":"keratose"},
{"word":"Keraunograph","class":"n.","meaning":"A figure or picture impressed by lightning upon the human body or elsewhere.","search":"keraunograph"},
{"word":"Kerb","class":"n.","meaning":"See Curb.","search":"kerb"},
{"word":"Kerbstone","class":"n.","meaning":"See Curbstone.","search":"kerbstone"},
{"word":"Kercher","class":"n.","meaning":"A kerchief.","search":"kercher"},
{"word":"Kerchered","class":"a.","meaning":"Covered, or bound round, with a kercher.","search":"kerchered"},
{"word":"Kerchiefs","class":"pl. ","meaning":"of Kerchief","search":"kerchiefs"},
{"word":"Kerchief","class":"n.","meaning":"A square of fine linen worn by women as a covering for the head; hence, anything similar in form or material, worn for ornament on other parts of the person; -- mostly used in compounds; as, neckerchief; breastkerchief; and later, handkerchief.","search":"kerchief"},
{"word":"Kerchief","class":"n.","meaning":"A lady who wears a kerchief.","search":"kerchief"},
{"word":"Kerchiefed","class":"a.","meaning":"Alt. of Kerchieft","search":"kerchiefed"},
{"word":"Kerchieft","class":"a.","meaning":"Dressed; hooded; covered; wearing a kerchief.","search":"kerchieft"},
{"word":"Kerf","class":"n.","meaning":"A notch, channel, or slit made in any material by cutting or sawing.","search":"kerf"},
{"word":"Kerite","class":"n.","meaning":"A compound in which tar or asphaltum combined with animal or vegetable oils is vulcanized by sulphur, the product closely resembling rubber; -- used principally as an insulating material in telegraphy.","search":"kerite"},
{"word":"Kerl","class":"n.","meaning":"See Carl.","search":"kerl"},
{"word":"Kermes","class":"n.","meaning":"The dried bodies of the females of a scale insect (Coccus ilicis), allied to the cochineal insect, and found on several species of oak near the Mediterranean. They are round, about the size of a pea, contain coloring matter analogous to carmine, and are used in dyeing. They were anciently thought to be of a vegetable nature, and were used in medicine.","search":"kermes"},
{"word":"Kermes","class":"n.","meaning":"A small European evergreen oak (Quercus coccifera) on which the kermes insect (Coccus ilicis) feeds.","search":"kermes"},
{"word":"Kermesse","class":"n.","meaning":"See Kirmess.","search":"kermesse"},
{"word":"Kern","class":"n.","meaning":"A light-armed foot soldier of the ancient militia of Ireland and Scotland; -- distinguished from gallowglass, and often used as a term of contempt.","search":"kern"},
{"word":"Kern","class":"n.","meaning":"Any kind of boor or low-lived person.","search":"kern"},
{"word":"Kern","class":"n.","meaning":"An idler; a vagabond.","search":"kern"},
{"word":"Kern","class":"n.","meaning":"A part of the face of a type which projects beyond the body, or shank.","search":"kern"},
{"word":"Kerned","class":"imp. & p. p.","meaning":"of Kern","search":"kerned"},
{"word":"Kerning","class":"p. pr. & vb. n.","meaning":"of Kern","search":"kerning"},
{"word":"Kern","class":"v. t.","meaning":"To form with a kern. See 2d Kern.","search":"kern"},
{"word":"Kern","class":"n.","meaning":"A churn.","search":"kern"},
{"word":"Kern","class":"n.","meaning":"A hand mill. See Quern.","search":"kern"},
{"word":"Kern","class":"v. i.","meaning":"To harden, as corn in ripening.","search":"kern"},
{"word":"Kern","class":"v. i.","meaning":"To take the form of kernels; to granulate.","search":"kern"},
{"word":"Kerned","class":"a.","meaning":"Having part of the face projecting beyond the body or shank; -- said of type.","search":"kerned"},
{"word":"Kernel","class":"n.","meaning":"The essential part of a seed; all that is within the seed walls; the edible substance contained in the shell of a nut; hence, anything included in a shell, husk, or integument; as, the kernel of a nut. See Illust. of Endocarp.","search":"kernel"},
{"word":"Kernel","class":"n.","meaning":"A single seed or grain; as, a kernel of corn.","search":"kernel"},
{"word":"Kernel","class":"n.","meaning":"A small mass around which other matter is concreted; a nucleus; a concretion or hard lump in the flesh.","search":"kernel"},
{"word":"Kernel","class":"n.","meaning":"The central, substantial or essential part of anything; the gist; the core; as, the kernel of an argument.","search":"kernel"},
{"word":"Kerneled","class":"imp. & p. p.","meaning":"of Kernel","search":"kerneled"},
{"word":"Kernelled","class":"","meaning":"of Kernel","search":"kernelled"},
{"word":"Kerneling","class":"p. pr. & vb. n.","meaning":"of Kernel","search":"kerneling"},
{"word":"Kernelling","class":"","meaning":"of Kernel","search":"kernelling"},
{"word":"Kernel","class":"v. i.","meaning":"To harden or ripen into kernels; to produce kernels.","search":"kernel"},
{"word":"Kerneled","class":"a.","meaning":"Alt. of Kernelled","search":"kerneled"},
{"word":"Kernelled","class":"a.","meaning":"Having a kernel.","search":"kernelled"},
{"word":"Kernelly","class":"a.","meaning":"Full of kernels; resembling kernels; of the nature of kernels.","search":"kernelly"},
{"word":"Kerish","class":"a.","meaning":"Clownish; boorish.","search":"kerish"},
{"word":"Kerolite","class":"n.","meaning":"Same as Cerolite.","search":"kerolite"},
{"word":"Kerosene","class":"n.","meaning":"An oil used for illuminating purposes, formerly obtained from the distillation of mineral wax, bituminous shale, etc., and hence called also coal oil. It is now produced in immense quantities, chiefly by the distillation and purification of petroleum. It consists chiefly of several hydrocarbons of the methane series.","search":"kerosene"},
{"word":"Kers","class":"n.","meaning":"Alt. of Kerse","search":"kers"},
{"word":"Kerse","class":"n.","meaning":"A cress.","search":"kerse"},
{"word":"Kerseys","class":"pl. ","meaning":"of Kersey","search":"kerseys"},
{"word":"Kersey","class":"n.","meaning":"A kind of coarse, woolen cloth, usually ribbed, woven from wool of long staple.","search":"kersey"},
{"word":"Kerseymere","class":"n.","meaning":"See Cassimere.","search":"kerseymere"},
{"word":"Kerseynette","class":"n.","meaning":"See Cassinette.","search":"kerseynette"},
{"word":"Kerve","class":"v. t.","meaning":"To carve.","search":"kerve"},
{"word":"Kerver","class":"n.","meaning":"A carver.","search":"kerver"},
{"word":"Kesar","class":"n.","meaning":"See Kaiser.","search":"kesar"},
{"word":"Keslop","class":"n.","meaning":"The stomach of a calf, prepared for rennet.","search":"keslop"},
{"word":"Kess","class":"v. t.","meaning":"To kiss.","search":"kess"},
{"word":"Kest","class":"imp.","meaning":"of Cast.","search":"kest"},
{"word":"Kestrel","class":"n.","meaning":"A small, slender European hawk (Falco alaudarius), allied to the sparrow hawk. Its color is reddish fawn, streaked and spotted with white and black. Also called windhover and stannel. The name is also applied to other allied species.","search":"kestrel"},
{"word":"Ket","class":"n.","meaning":"Carrion; any filth.","search":"ket"},
{"word":"Ketch","class":"n.","meaning":"An almost obsolete form of vessel, with a mainmast and a mizzenmast, -- usually from one hundred to two hundred and fifty tons burden.","search":"ketch"},
{"word":"Ketch","class":"n.","meaning":"A hangman. See Jack Ketch.","search":"ketch"},
{"word":"Ketch","class":"v. t.","meaning":"To catch.","search":"ketch"},
{"word":"Ketchup","class":"n.","meaning":"A sauce. See Catchup.","search":"ketchup"},
{"word":"Ketine","class":"n.","meaning":"One of a series of organic bases obtained by the reduction of certain isonitroso compounds of the ketones. In general they are unstable oily substances having a pungent aromatic odor.","search":"ketine"},
{"word":"Ketmie","class":"n.","meaning":"The name of certain African species of Hibiscus, cultivated for the acid of their mucilage.","search":"ketmie"},
{"word":"Ketol","class":"n.","meaning":"One of a series of series of complex nitrogenous substances, represented by methyl ketol and related to indol.","search":"ketol"},
{"word":"Ketone","class":"n.","meaning":"One of a large class of organic substances resembling the aldehydes, obtained by the distillation of certain salts of organic acids and consisting of carbonyl (CO) united with two hydrocarbon radicals. In general the ketones are colorless volatile liquids having a pungent ethereal odor.","search":"ketone"},
{"word":"Ketonic","class":"a.","meaning":"Pertaining to, or derived from, a ketone; as, a ketonic acid.","search":"ketonic"},
{"word":"Kettle","class":"n.","meaning":"A metallic vessel, with a wide mouth, often without a cover, used for heating and boiling water or other liguids.","search":"kettle"},
{"word":"Kettledrum","class":"n.","meaning":"A drum made of thin copper in the form of a hemispherical kettle, with parchment stretched over the mouth of it.","search":"kettledrum"},
{"word":"Kettledrum","class":"n.","meaning":"An informal social party at which a light collation is offered, held in the afternoon or early evening.  Cf. Drum, n., 4 and 5.","search":"kettledrum"},
{"word":"Kettledrummer","class":"n.","meaning":"One who plays on a kettledrum.","search":"kettledrummer"},
{"word":"Keuper","class":"n.","meaning":"The upper division of the European Triassic. See Chart of Geology.","search":"keuper"},
{"word":"Kevel","class":"n.","meaning":"A strong cleat to which large ropes are belayed.","search":"kevel"},
{"word":"Kevel","class":"n.","meaning":"A stone mason's hammer.","search":"kevel"},
{"word":"Kevel","class":"n.","meaning":"Alt. of Kevin","search":"kevel"},
{"word":"Kevin","class":"n.","meaning":"The gazelle.","search":"kevin"},
{"word":"Kever","class":"v. t. &","meaning":"i. To cover.","search":"kever"},
{"word":"Keverchief","class":"n.","meaning":"A kerchief.","search":"keverchief"},
{"word":"Kex","class":"n.","meaning":"A weed; a kecksy.","search":"kex"},
{"word":"Kex","class":"n.","meaning":"A dry husk or covering.","search":"kex"},
{"word":"Key","class":"n.","meaning":"An instrument by means of which the bolt of a lock is shot or drawn; usually, a removable metal instrument fitted to the mechanism of a particular lock and operated by turning in its place.","search":"key"},
{"word":"Key","class":"n.","meaning":"An instrument which is turned like a key in fastening or adjusting any mechanism; as, a watch key; a bed key, etc.","search":"key"},
{"word":"Key","class":"n.","meaning":"That part of an instrument or machine which serves as the means of operating it; as, a telegraph key; the keys of a pianoforte, or of a typewriter.","search":"key"},
{"word":"Key","class":"n.","meaning":"A position or condition which affords entrance, control, pr possession, etc.; as, the key of a line of defense; the key of a country; the key of a political situation. Hence, that which serves to unlock, open, discover, or solve something unknown or difficult; as, the key to a riddle; the key to a problem.","search":"key"},
{"word":"Key","class":"n.","meaning":"That part of a mechanism which serves to lock up, make fast, or adjust to position.","search":"key"},
{"word":"Key","class":"n.","meaning":"A piece of wood used as a wedge.","search":"key"},
{"word":"Key","class":"n.","meaning":"The last board of a floor when laid down.","search":"key"},
{"word":"Key","class":"n.","meaning":"A keystone.","search":"key"},
{"word":"Key","class":"n.","meaning":"That part of the plastering which is forced through between the laths and holds the rest in place.","search":"key"},
{"word":"Key","class":"n.","meaning":"A wedge to unite two or more pieces, or adjust their relative position; a cotter; a forelock.","search":"key"},
{"word":"Key","class":"n.","meaning":"A bar, pin or wedge, to secure a crank, pulley, coupling, etc., upon a shaft, and prevent relative turning; sometimes holding by friction alone, but more frequently by its resistance to shearing, being usually embedded partly in the shaft and partly in the crank, pulley, etc.","search":"key"},
{"word":"Key","class":"n.","meaning":"An indehiscent, one-seeded fruit furnished with a wing, as the fruit of the ash and maple; a samara; -- called also key fruit.","search":"key"},
{"word":"Key","class":"n.","meaning":"A family of tones whose regular members are called diatonic tones, and named key tone  (or tonic) or one (or eight), mediant or three, dominant or five, subdominant or four, submediant or six, supertonic or two, and subtonic or seven. Chromatic tones are temporary members of a key, under such names as ","search":"key"},
{"word":"Key","class":"n.","meaning":"The fundamental tone of a movement to which its modulations are referred, and with which it generally begins and ends; keynote.","search":"key"},
{"word":"Key","class":"n.","meaning":"Fig: The general pitch or tone of a sentence or utterance.","search":"key"},
{"word":"Keved","class":"imp. & p. p.","meaning":"of Key","search":"keved"},
{"word":"Keying","class":"p. pr. & vb. n.","meaning":"of Key","search":"keying"},
{"word":"Key","class":"v. t.","meaning":"To fasten or secure firmly; to fasten or tighten with keys or wedges.","search":"key"},
{"word":"Keyage","class":"n.","meaning":"Wharfage; quayage.","search":"keyage"},
{"word":"Keyboard","class":"n.","meaning":"The whole arrangement, or one range, of the keys of an organ, typewriter, etc.","search":"keyboard"},
{"word":"Key-cold","class":"a.","meaning":"Cold as a metallic key; lifeless.","search":"key-cold"},
{"word":"Keyed","class":"a.","meaning":"Furnished with keys; as, a keyed instrument; also, set to a key, as a tune.","search":"keyed"},
{"word":"Keyhole","class":"n.","meaning":"A hole or apertupe in a door or lock, for receiving a key.","search":"keyhole"},
{"word":"Keyhole","class":"n.","meaning":"A hole or excavation in beams intended to be joined together, to receive the key which fastens them.","search":"keyhole"},
{"word":"Keyhole","class":"n.","meaning":"a mortise for a key or cotter.","search":"keyhole"},
{"word":"Keynote","class":"n.","meaning":"The tonic or first tone of the scale in which a piece or passage is written; the fundamental tone of the chord, to which all the modulations of the piece are referred; -- called also key tone.","search":"keynote"},
{"word":"Keynote","class":"n.","meaning":"The fundamental fact or idea; that which gives the key; as, the keynote of a policy or a sermon.","search":"keynote"},
{"word":"Keyseat","class":"v. t.","meaning":"To form a key seat, as by cutting. See Key seat, under Key.","search":"keyseat"},
{"word":"Keystone","class":"n.","meaning":"The central or topmost stone of an arch. This in some styles is made different in size from the other voussoirs, or projects, or is decorated with carving. See Illust. of Arch.","search":"keystone"},
{"word":"Key tone","class":"","meaning":"See Keynote.","search":"key tone"},
{"word":"Keyway","class":"n.","meaning":"See Key way, under Key.","search":"keyway"},
{"word":"Khaliff","class":"n.","meaning":"See Caliph.","search":"khaliff"},
{"word":"Khamsin","class":"n.","meaning":"Same as Kamsin.","search":"khamsin"},
{"word":"Khan","class":"n.","meaning":"A king; a prince; a chief; a governor; -- so called among the Tartars, Turks, and Persians, and in countries now or formerly governed by them.","search":"khan"},
{"word":"Khan","class":"n.","meaning":"An Eastern inn or caravansary.","search":"khan"},
{"word":"Khanate","class":"n.","meaning":"Dominion or jurisdiction of a khan.","search":"khanate"},
{"word":"Khaya","class":"n.","meaning":"A lofty West African tree (Khaya Senegalensis), related to the mahogany, which it resembles in the quality of the wood. The bark is used as a febrifuge.","search":"khaya"},
{"word":"Khedive","class":"n.","meaning":"A governor or viceroy; -- a title granted in 1867 by the sultan of Turkey to the ruler of Egypt.","search":"khedive"},
{"word":"Khenna","class":"n.","meaning":"See Henna.","search":"khenna"},
{"word":"Kholah","class":"n.","meaning":"The Indian jackal.","search":"kholah"},
{"word":"Kholsun","class":"n.","meaning":"The dhole.","search":"kholsun"},
{"word":"Khutbah","class":"n.","meaning":"An address or public prayer read from the steps of the pulpit in Mohammedan mosques, offering glory to God, praising Mohammed and his descendants, and the ruling princes.","search":"khutbah"},
{"word":"Kiabooca wood","class":"","meaning":"See Kyaboca wood.","search":"kiabooca wood"},
{"word":"Kiang","class":"n.","meaning":"The dziggetai.","search":"kiang"},
{"word":"Kibble","class":"v. t.","meaning":"To bruise; to grind coarsely; as, kibbled oats.","search":"kibble"},
{"word":"Kibble","class":"n.","meaning":"A large iron bucket used in Cornwall and Wales for raising ore out of mines.","search":"kibble"},
{"word":"Kibblings","class":"n. pl.","meaning":"Portions of small fish used for bait on the banks of Newfoundland.","search":"kibblings"},
{"word":"Kibe","class":"n.","meaning":"A chap or crack in the flesh occasioned by cold; an ulcerated chilblain.","search":"kibe"},
{"word":"Kibed","class":"a.","meaning":"Chapped; cracked with cold; affected with chilblains; as kibed heels.","search":"kibed"},
{"word":"Kibitkas","class":"pl. ","meaning":"of Kibitka","search":"kibitkas"},
{"word":"Kibitka","class":"n.","meaning":"A tent used by the Kirghiz Tartars.","search":"kibitka"},
{"word":"Kibitka","class":"n.","meaning":"A rude kind of Russian vehicle, on wheels or on runners, sometimes covered with cloth or leather, and often used as a movable habitation.","search":"kibitka"},
{"word":"Kiblah","class":"n.","meaning":"See Keblah.","search":"kiblah"},
{"word":"Kiby","class":"a.","meaning":"Affected with kibes.","search":"kiby"},
{"word":"Kichil","class":"n.","meaning":"See Kechil.","search":"kichil"},
{"word":"Kicred","class":"imp. & p. p.","meaning":"of Kick","search":"kicred"},
{"word":"Kicking","class":"p. pr. & vb. n.","meaning":"of Kick","search":"kicking"},
{"word":"Kick","class":"v. t.","meaning":"To strike, thrust, or hit violently with the foot; as, a horse kicks a groom; a man kicks a dog.","search":"kick"},
{"word":"Kick","class":"v. i.","meaning":"To thrust out the foot or feet with violence; to strike out with the foot or feet, as in defense or in bad temper; esp., to strike backward, as a horse does, or to have a habit of doing so. Hence, figuratively: To show ugly resistance, opposition, or hostility; to spurn.","search":"kick"},
{"word":"Kick","class":"v. i.","meaning":"To recoil; -- said of a musket, cannon, etc.","search":"kick"},
{"word":"Kick","class":"n.","meaning":"A blow with the foot or feet; a striking or thrust with the foot.","search":"kick"},
{"word":"Kick","class":"n.","meaning":"The projection on the tang of the blade of a pocket knife, which prevents the edge of the blade from striking the spring. See Illust. of Pocketknife.","search":"kick"},
{"word":"Kick","class":"n.","meaning":"A projection in a mold, to form a depression in the surface of the brick.","search":"kick"},
{"word":"Kick","class":"n.","meaning":"The recoil of a musket or other firearm, when discharged.","search":"kick"},
{"word":"Kickable","class":"a.","meaning":"Capable or deserving of being kicked.","search":"kickable"},
{"word":"Kickapoos","class":"n. pl.","meaning":"A tribe of Indians which formerly occupied the region of Northern Illinois, allied in language to the Sacs and Foxes.","search":"kickapoos"},
{"word":"Kicker","class":"n.","meaning":"One who, or that which, kicks.","search":"kicker"},
{"word":"Kickshaw","class":"n.","meaning":"See Kickshaws, the correct singular.","search":"kickshaw"},
{"word":"Kickshawses","class":"pl. ","meaning":"of Kickshaws","search":"kickshawses"},
{"word":"Kickshaws","class":"n.","meaning":"Something fantastical; any trifling, trumpery thing; a toy.","search":"kickshaws"},
{"word":"Kickshaws","class":"n.","meaning":"A fancy dish; a titbit; a delicacy.","search":"kickshaws"},
{"word":"Kickshoe","class":"n.","meaning":"A kickshaws.","search":"kickshoe"},
{"word":"Kicksy-wicksy","class":"n.","meaning":"Alt. of Kicky-wisky","search":"kicksy-wicksy"},
{"word":"Kicky-wisky","class":"n.","meaning":"That which is restless and uneasy.","search":"kicky-wisky"},
{"word":"Kicksy-wicksy","class":"a.","meaning":"Fantastic; restless; as, kicksy-wicksy flames.","search":"kicksy-wicksy"},
{"word":"Kickup","class":"n.","meaning":"The water thrush or accentor.","search":"kickup"},
{"word":"Kid","class":"n.","meaning":"A young goat.","search":"kid"},
{"word":"Kid","class":"n.","meaning":"A young child or infant; hence, a simple person, easily imposed on.","search":"kid"},
{"word":"Kid","class":"n.","meaning":"A kind of leather made of the skin of the young goat, or of the skin of rats, etc.","search":"kid"},
{"word":"Kid","class":"n.","meaning":"Gloves made of kid.","search":"kid"},
{"word":"Kid","class":"n.","meaning":"A small wooden mess tub; -- a name given by sailors to one in which they receive their food.","search":"kid"},
{"word":"Kidded","class":"imp. & p. p.","meaning":"of Kid","search":"kidded"},
{"word":"Kidding","class":"p. pr. & vb. n.","meaning":"of Kid","search":"kidding"},
{"word":"Kid","class":"v. i.","meaning":"To bring forth a young goat.","search":"kid"},
{"word":"Kid","class":"n.","meaning":"A fagot; a bundle of heath and furze.","search":"kid"},
{"word":"Kid","class":"p. p.","meaning":"of Kythe.","search":"kid"},
{"word":"Kid","class":"v. t.","meaning":"See Kiddy, v. t.","search":"kid"},
{"word":"Kidde","class":"imp.","meaning":"of Kythe.","search":"kidde"},
{"word":"Kidderminster","class":"n.","meaning":"A kind of ingrain carpeting, named from the English town where formerly most of it was manufactured.","search":"kidderminster"},
{"word":"Kiddier","class":"n.","meaning":"A huckster; a cadger.","search":"kiddier"},
{"word":"Kiddle","class":"n.","meaning":"A kind of basketwork wear in a river, for catching fish.","search":"kiddle"},
{"word":"Kiddow","class":"n.","meaning":"The guillemot.","search":"kiddow"},
{"word":"Kiddy","class":"v. t.","meaning":"To deceive; to outwit; to hoax.","search":"kiddy"},
{"word":"Kiddy","class":"n.","meaning":"A young fellow; formerly, a low thief.","search":"kiddy"},
{"word":"Kiddyish","class":"a.","meaning":"Frolicsome; sportive.","search":"kiddyish"},
{"word":"Kidfox","class":"","meaning":"A young fox.","search":"kidfox"},
{"word":"Kidling","class":"n.","meaning":"A young kid.","search":"kidling"},
{"word":"Kidnaped","class":"imp. & p. p.","meaning":"of Kidnap","search":"kidnaped"},
{"word":"Kidnapped","class":"","meaning":"of Kidnap","search":"kidnapped"},
{"word":"Kidnaping","class":"p. pr. & vb. n.","meaning":"of Kidnap","search":"kidnaping"},
{"word":"Kidnapping","class":"","meaning":"of Kidnap","search":"kidnapping"},
{"word":"Kidnap","class":"v. t.","meaning":"To take (any one) by force or fear, and against one's will, with intent to carry to another place.","search":"kidnap"},
{"word":"Kidnaper","class":"n.","meaning":"Alt. of Kidnapper","search":"kidnaper"},
{"word":"Kidnapper","class":"n.","meaning":"One who steals or forcibly carries away a human being; a manstealer.","search":"kidnapper"},
{"word":"Kidneys","class":"pl. ","meaning":"of Kidney","search":"kidneys"},
{"word":"Kidney","class":"n.","meaning":"A glandular organ which excretes urea and other waste products from the animal body; a urinary gland.","search":"kidney"},
{"word":"Kidney","class":"n.","meaning":"Habit; disposition; sort; kind.","search":"kidney"},
{"word":"Kidney","class":"n.","meaning":"A waiter.","search":"kidney"},
{"word":"Kidney-form","class":"a.","meaning":"Alt. of Kidney-shaped","search":"kidney-form"},
{"word":"Kidney-shaped","class":"a.","meaning":"Having the form or shape of a kidney; reniform; as, a kidney-shaped leaf.","search":"kidney-shaped"},
{"word":"Kidneywort","class":"n.","meaning":"A kind of saxifrage (Saxifrage stellaris).","search":"kidneywort"},
{"word":"Kidneywort","class":"n.","meaning":"The navelwort.","search":"kidneywort"},
{"word":"Kie","class":"n. pl.","meaning":"Kine; cows.","search":"kie"},
{"word":"Kiefekil","class":"n.","meaning":"A species of clay; meerschaum.","search":"kiefekil"},
{"word":"Kier","class":"n.","meaning":"A large tub or vat in which goods are subjected to the action of hot lye or bleaching liquor; -- also called keeve.","search":"kier"},
{"word":"Kieselguhr","class":"n.","meaning":"Siliceous earth; specifically, porous infusorial earth, used as an absorbent of nitroglycerin in the manufacture of dynamite.","search":"kieselguhr"},
{"word":"Kieserite","class":"n.","meaning":"Hydrous sulphate of magnesia found at the salt mines of Stassfurt, Prussian Saxony.","search":"kieserite"},
{"word":"Kieve","class":"n.","meaning":"See Keeve, n.","search":"kieve"},
{"word":"Kike","class":"v. i.","meaning":"To gaze; to stare.","search":"kike"},
{"word":"Kike","class":"v. t. & i.","meaning":"To kick.","search":"kike"},
{"word":"Kilderkin","class":"n.","meaning":"A small barrel; an old liquid measure containing eighteen English beer gallons, or nearly twenty-two gallons, United States measure.","search":"kilderkin"},
{"word":"Kill","class":"n.","meaning":"A kiln.","search":"kill"},
{"word":"Kill","class":"n.","meaning":"A channel or arm of the sea; a river; a stream; as, the channel between Staten Island and Bergen Neck is the Kill van Kull, or the Kills; -- used also in composition; as, Schuylkill, Catskill, etc.","search":"kill"},
{"word":"Killed","class":"imp. & p. p.","meaning":"of Kill","search":"killed"},
{"word":"Killing","class":"p. pr. & vb. n.","meaning":"of Kill","search":"killing"},
{"word":"Kill","class":"v. t.","meaning":"To deprive of life, animal or vegetable, in any manner or by any means; to render inanimate; to put to death; to slay.","search":"kill"},
{"word":"Kill","class":"v. t.","meaning":"To destroy; to ruin; as, to kill one's chances; to kill the sale of a book.","search":"kill"},
{"word":"Kill","class":"v. t.","meaning":"To cause to cease; to quell; to calm; to still; as, in seamen's language, a shower of rain kills the wind.","search":"kill"},
{"word":"Kill","class":"v. t.","meaning":"To destroy the effect of; to counteract; to neutralize; as, alkali kills acid.","search":"kill"},
{"word":"Killdee","class":"n.","meaning":"Alt. of Killdeer","search":"killdee"},
{"word":"Killdeer","class":"n.","meaning":"A small American plover (Aegialitis vocifera).","search":"killdeer"},
{"word":"Killer","class":"n.","meaning":"One who deprives of life; one who, or that which, kills.","search":"killer"},
{"word":"Killer","class":"n.","meaning":"A voracious, toothed whale of the genus Orca, of which several species are known.","search":"killer"},
{"word":"Killesse","class":"n.","meaning":"A gutter, groove, or channel.","search":"killesse"},
{"word":"Killesse","class":"n.","meaning":"A hipped roof.","search":"killesse"},
{"word":"Killifish","class":"n.","meaning":"Any one of several small American cyprinodont fishes of the genus Fundulus and allied genera. They live equally well in fresh and brackish water, or even in the sea. They are usually striped or barred with black. Called also minnow, and brook fish. See Minnow.","search":"killifish"},
{"word":"Killigrew","class":"n.","meaning":"The Cornish chough. See under Chough.","search":"killigrew"},
{"word":"Killikinick","class":"n.","meaning":"See Kinnikinic.","search":"killikinick"},
{"word":"Killing","class":"a.","meaning":"Literally, that kills; having power to kill; fatal; in a colloquial sense, conquering; captivating; irresistible.","search":"killing"},
{"word":"Kill-joy","class":"n.","meaning":"One who causes gloom or grief; a dispiriting person.","search":"kill-joy"},
{"word":"Killock","class":"n.","meaning":"A small anchor; also, a kind of anchor formed by a stone inclosed by pieces of wood fastened together.","search":"killock"},
{"word":"Killow","class":"n.","meaning":"An earth of a blackish or deep blue color.","search":"killow"},
{"word":"Kiln","class":"n.","meaning":"A large stove or oven; a furnace of brick or stone, or a heated chamber, for the purpose of hardening, burning, or drying anything; as, a kiln for baking or hardening earthen vessels; a kiln for drying grain, meal, lumber, etc.; a kiln for calcining limestone.","search":"kiln"},
{"word":"Kiln","class":"n.","meaning":"A furnace for burning bricks; a brickkiln.","search":"kiln"},
{"word":"Kiln-dry","class":"v. t.","meaning":"To dry in a kiln; as, to kiln-dry meal or grain.","search":"kiln-dry"},
{"word":"Kilnhole","class":"n.","meaning":"The mouth or opening of an oven or kiln.","search":"kilnhole"},
{"word":"Kilos","class":"pl. ","meaning":"of Kilo","search":"kilos"},
{"word":"Kilo","class":"n.","meaning":"An abbreviation of Kilogram.","search":"kilo"},
{"word":"Kilogram","class":"n.","meaning":"Alt. of Kilogramme","search":"kilogram"}
],"length":     566,"tag": "k"}
